In [292]:
import pandas as pd
import pyodbc

In [ ]:
#----------------------------------- Configura la conexión a SQL Server DataMart --------------------------------
conn = pyodbc.connect(
    'DRIVER={ODBC Driver 17 for SQL Server};'  # Asegúrate de tener el controlador adecuado
    'SERVER=localhost;'                  # Reemplaza con el nombre de tu servidor
    'DATABASE=datamart_proyecto15;'           # Reemplaza con el nombre de tu base de datos
    'UID=sa;'                             # Reemplaza con tu nombre de usuario
    'PWD=1234567890'                           # Reemplaza con tu contraseña
)
cursor = conn.cursor()

In [ ]:
# Crear las tablas de dimensiones y tabla de hechos en SQL Server

cursor.execute("""
IF OBJECT_ID('dimTiempo', 'U') IS NULL
    CREATE TABLE dimTiempo (
        idTiempo INT PRIMARY KEY,
        año INT,
        mes INT
    );

IF OBJECT_ID('dimDistrito', 'U') IS NULL
    CREATE TABLE dimDistrito (
        id_distrito INT PRIMARY KEY,
        nombre_distrito VARCHAR(255)
    );    
    
IF OBJECT_ID('dimProvincia', 'U') IS NULL
    CREATE TABLE dimProvincia (
        id_provincia INT PRIMARY KEY,
        nombre_provincia VARCHAR(255)
    );    
    
IF OBJECT_ID('dimDepartamento', 'U') IS NULL
    CREATE TABLE dimDepartamento (
        id_departamento INT PRIMARY KEY,
        nombre_departamento VARCHAR(255)
    ); 

IF OBJECT_ID('dimSexo', 'U') IS NULL
    CREATE TABLE dimSexo (
        idSexo INT PRIMARY KEY,
        sexo VARCHAR(255)
    );

IF OBJECT_ID('dimEstadoCivil', 'U') IS NULL
    CREATE TABLE dimEstadoCivil (
        idEstadoCivil INT PRIMARY KEY,
        estadoCivil VARCHAR(255)
    );

IF OBJECT_ID('dimEducacion', 'U') IS NULL
    CREATE TABLE dimEducacion (
        idEducacion INT PRIMARY KEY,
        gradoInstruccion VARCHAR(255)
    );

IF OBJECT_ID('dimTrabajo', 'U') IS NULL
    CREATE TABLE dimTrabajo (
        idTrabajo INT PRIMARY KEY,
        laborDesempeñada VARCHAR(255)
    );

IF OBJECT_ID('dimTipoVivienda', 'U') IS NULL
    CREATE TABLE dimTipoVivienda (
        idTipoVivienda INT PRIMARY KEY,
        tipoVivienda VARCHAR(255)
    );

IF OBJECT_ID('dimAgua', 'U') IS NULL
    CREATE TABLE dimAgua (
        idAgua INT PRIMARY KEY,
        agua VARCHAR(255)
    );

IF OBJECT_ID('dimTelefono', 'U') IS NULL
    CREATE TABLE dimTelefono (
        idTelefono INT PRIMARY KEY,
        telefono VARCHAR(255)
    );

IF OBJECT_ID('dimCelular', 'U') IS NULL
    CREATE TABLE dimCelular (
        idCelular INT PRIMARY KEY,
        celular VARCHAR(255)
    );

IF OBJECT_ID('dimTelevision', 'U') IS NULL
    CREATE TABLE dimTelevision (
        idTelevision INT PRIMARY KEY,
        television VARCHAR(255)
    );

IF OBJECT_ID('dimInternet', 'U') IS NULL
    CREATE TABLE dimInternet (
        idInternet INT PRIMARY KEY,
        internet VARCHAR(255)
    );

IF OBJECT_ID('dimServiciosHigienicos', 'U') IS NULL
    CREATE TABLE dimServiciosHigienicos (
        idServiciosHigienicos INT PRIMARY KEY,
        serviciosHigienicos VARCHAR(255)
    );
               
IF OBJECT_ID('dimEducacionNiños', 'U') IS NULL
    CREATE TABLE dimEducacionNiños (
        idEducacionNiños INT PRIMARY KEY,
        niñosEnColegio VARCHAR(255)
    );

IF OBJECT_ID('dimEstadoVivienda', 'U') IS NULL
    CREATE TABLE dimEstadoVivienda (
        idEstadoVivienda INT PRIMARY KEY,
        estadoVivienda VARCHAR(255)
    );

IF OBJECT_ID('factBalanceEconomico', 'U') IS NULL
    CREATE TABLE factBalanceEconomico (
        idTiempo INT,
        id_departamento INT,
        id_provincia INT,
        id_distrito INT,
        idSexo INT,
        idEstadoCivil INT,
        idEducacion INT,
        idTrabajo INT,
        idTipoVivienda INT,
        idAgua INT,
        idTelefono INT,
        idCelular INT,
        idTelevision INT,
        idInternet INT,
        idServiciosHigienicos INT,
        idEducacionNiños INT,
        idEstadoVivienda INT,
        gananciaNeta FLOAT,
        gastoEnProductos FLOAT,
        horasTrabajoSemAnterior INT,
        tiempoTrabajoAños INT,
        tiempoTrabajoMeses INT,
        numeroHabitaciones INT,
        altitud FLOAT,
        latitud FLOAT,
        longitud FLOAT,
        FOREIGN KEY (idTiempo) REFERENCES dimTiempo(idTiempo),
        FOREIGN KEY (id_departamento) REFERENCES dimDepartamento(id_departamento),
        FOREIGN KEY (id_provincia) REFERENCES dimProvincia(id_provincia),
        FOREIGN KEY (id_distrito) REFERENCES dimDistrito(id_distrito),
        FOREIGN KEY (idSexo) REFERENCES dimSexo(idSexo),
        FOREIGN KEY (idEstadoCivil) REFERENCES dimEstadoCivil(idEstadoCivil),
        FOREIGN KEY (idEducacion) REFERENCES dimEducacion(idEducacion),
        FOREIGN KEY (idTrabajo) REFERENCES dimTrabajo(idTrabajo),
        FOREIGN KEY (idTipoVivienda) REFERENCES dimTipoVivienda(idTipoVivienda),
        FOREIGN KEY (idAgua) REFERENCES dimAgua(idAgua),
        FOREIGN KEY (idTelefono) REFERENCES dimTelefono(idTelefono),
        FOREIGN KEY (idCelular) REFERENCES dimCelular(idCelular),
        FOREIGN KEY (idTelevision) REFERENCES dimTelevision(idTelevision),
        FOREIGN KEY (idInternet) REFERENCES dimInternet(idInternet),
        FOREIGN KEY (idServiciosHigienicos) REFERENCES dimServiciosHigienicos(idServiciosHigienicos),
        FOREIGN KEY (idEducacionNiños) REFERENCES dimEducacionNiños(idEducacionNiños),
        FOREIGN KEY (idEstadoVivienda) REFERENCES dimEstadoVivienda(idEstadoVivienda)
    );
""")

conn.commit()
print("Tablas de dimensiones y tabla de hechos creadas o verificadas con éxito.")

Tablas de dimensiones y tabla de hechos creadas o verificadas con éxito.

In [295]:
def obtener_unicos_df(df, columna):
    """Devuelve un DataFrame con los valores únicos de una columna en el DataFrame."""
    if columna in df.columns:
        # Obtener los valores únicos y convertirlos en un DataFrame
        return pd.DataFrame(df[columna].unique(), columns=[columna])
    else:
        raise ValueError(f"La columna '{columna}' no existe en el DataFrame.")

In [296]:
df = pd.read_pickle('../Datasets/df_finalisimo.pkl')
df.head(1)

,AÑO,MES,CONGLOME,VIVIENDA,HOGAR,CODPERSO,UBIGEO_x,DOMINIO_x,LABOR_QUE_DESEMPEÑA,HORAS_TRABAJO_SEM_ANTERIOR,...,Internet,Servicios higienicos,Niños en colegio,ubigeo_inei,departamento,provincia,distrito,altitud,latitud,longitud
0,2013,5,0001,048,11,01,10101,Sierra Norte,Trabajador Independiente,49,...,No,No,Hogares con niños que asisten a la escuela,10101,AMAZONAS,CHACHAPOYAS,CHACHAPOYAS,2338.0,-6.2294,-77.8728

In [297]:
df.drop(columns=['CONGLOME', 'VIVIENDA', 'HOGAR', 'CODPERSO', 'UBIGEO_x','ubigeo_inei','DOMINIO_x'],inplace=True)
df.head()

,AÑO,MES,LABOR_QUE_DESEMPEÑA,HORAS_TRABAJO_SEM_ANTERIOR,TIEMPO_TRABAJO_AÑOS,TIEMPO_TRABAJO_MESES,GANANCIA_NETA,GASTO_EN_PRODUCTOS,SEXO,ESTADO_CIVIL,...,Television,Internet,Servicios higienicos,Niños en colegio,departamento,provincia,distrito,altitud,latitud,longitud
0,2013,5,Trabajador Independiente,49,1,0,27.0,152.0,Mujer,Viudo(a),...,Sí,No,No,Hogares con niños que asisten a la escuela,AMAZONAS,CHACHAPOYAS,CHACHAPOYAS,2338.0,-6.2294,-77.8728
1,2013,8,Trabajador Independiente,7,0,0,27.0,36.0,Mujer,Soltero(a),...,Sí,No,No,Hogares con niños que asisten a la escuela,AMAZONAS,CHACHAPOYAS,CHACHAPOYAS,2338.0,-6.2294,-77.8728
2,2013,8,Trabajador Independiente,21,4,0,120.0,36.0,Mujer,Conviviente,...,No,No,No,Hogares con niños que asisten a la escuela,AMAZONAS,CHACHAPOYAS,CHACHAPOYAS,2338.0,-6.2294,-77.8728
3,2013,11,Trabajador Independiente,43,27,0,457.0,208.0,Mujer,Casado(a),...,Sí,Sí,No,Hogares con niños que asisten a la escuela,AMAZONAS,CHACHAPOYAS,CHACHAPOYAS,2338.0,-6.2294,-77.8728
4,2013,11,Trabajador Independiente,42,53,0,27.0,39.0,Hombre,Casado(a),...,No,No,No,Hogares con niños que asisten a la escuela,AMAZONAS,CHACHAPOYAS,CHACHAPOYAS,2338.0,-6.2294,-77.8728

In [298]:
df.columns

Index(['AÑO', 'MES', 'LABOR_QUE_DESEMPEÑA', 'HORAS_TRABAJO_SEM_ANTERIOR',
       'TIEMPO_TRABAJO_AÑOS', 'TIEMPO_TRABAJO_MESES', 'GANANCIA_NETA',
       'GASTO_EN_PRODUCTOS', 'SEXO', 'ESTADO_CIVIL', 'GRADO_DE_INSTRUCCION',
       'Tipo de vivienda', 'Numero de habitaciones', 'Estado', 'Agua',
       'Telefono', 'Celular', 'Television', 'Internet', 'Servicios higienicos',
       'Niños en colegio', 'departamento', 'provincia', 'distrito', 'altitud',
       'latitud', 'longitud'],
      dtype='object')

In [299]:
# Crear DataFrames únicos para cada dimensión
df_tiempo = obtener_unicos_df(df, 'AÑO')
df_tiempo = df[['AÑO', 'MES']].drop_duplicates().reset_index(drop=True)

In [300]:
df_tiempo.head(20)

     AÑO  MES
0   2013    5
1   2013    8
2   2013   11
3   2013    2
4   2013    3
5   2013    4
6   2013    6
7   2013   10
8   2013    9
9   2013   12
10  2013    1
11  2013    7
12  2014    8
13  2014   11
14  2014    3
15  2014    6
16  2014   10
17  2014   12
18  2014    2
19  2014    7

In [301]:
df_sexo = obtener_unicos_df(df, 'SEXO')
df_estado_civil = obtener_unicos_df(df, 'ESTADO_CIVIL')
df_educacion = obtener_unicos_df(df, 'GRADO_DE_INSTRUCCION')
df_trabajo = obtener_unicos_df(df, 'LABOR_QUE_DESEMPEÑA')
df_tipo_vivienda = obtener_unicos_df(df, 'Tipo de vivienda')
df_estado_vivienda = obtener_unicos_df(df, 'Estado')
df_agua = obtener_unicos_df(df, 'Agua')
df_telefono = obtener_unicos_df(df, 'Telefono')
df_celular = obtener_unicos_df(df, 'Celular')
df_television = obtener_unicos_df(df, 'Television')
df_internet = obtener_unicos_df(df, 'Internet')
df_servicios_higienicos = obtener_unicos_df(df, 'Servicios higienicos')
df_educacion_ninos = obtener_unicos_df(df, 'Niños en colegio')
df_departamento = obtener_unicos_df(df, 'departamento')
df_provincia = obtener_unicos_df(df, 'provincia')
df_distrito = obtener_unicos_df(df, 'distrito')

In [302]:
df_sexo

     SEXO
0   Mujer
1  Hombre

In [303]:
df_estado_civil

    ESTADO_CIVIL
0       Viudo(a)
1     Soltero(a)
2    Conviviente
3      Casado(a)
4    Separado(a)
5  Divorciado(a)

In [304]:
df_educacion

                    GRADO_DE_INSTRUCCION
0                    Primaria Incompleta
1      Superior Universitaria Incompleta
2                    Secundaria Completa
3                              Sin Nivel
4                  Secundaria Incompleta
5                      Primaria Completa
6   Superior No Universitaria Incompleta
7     Superior No Universitaria Completa
8        Superior Universitaria Completa
9                     Maestria/Doctorado
10                               Inicial
11                       Básica especial

In [305]:
df_trabajo

        LABOR_QUE_DESEMPEÑA
0  Trabajador Independiente
1       Empleador o patrono

In [306]:
df_tipo_vivienda

                            Tipo de vivienda
0                         Casa independiente
1               Vivienda en casa de vecindad
2                             Choza o cabaña
3                         Vivienda en quinta
4                   Departamento en edificio
5                       Vivienda improvisada
6  Local no destinado para habitación humana
7                                       Otro

In [307]:
df_estado_vivienda

                                Estado
0            Propia, totalmente pagada
1  Cedida por otro hogar o institución
2                            Alquilada
3                 Propia, por invasión
4      Cedida por el centro de trabajo
5         Propia, comprándola a plazos
6                           Otra forma

In [308]:
# Generar identificadores únicos para cada DataFrame de dimensión
df_tiempo['idTiempo'] = range(1, len(df_tiempo) + 1)
df_sexo['idSexo'] = range(1, len(df_sexo) + 1)
df_estado_civil['idEstadoCivil'] = range(1, len(df_estado_civil) + 1)
df_educacion['idEducacion'] = range(1, len(df_educacion) + 1)
df_trabajo['idTrabajo'] = range(1, len(df_trabajo) + 1)
df_tipo_vivienda['idTipoVivienda'] = range(1, len(df_tipo_vivienda) + 1)
df_estado_vivienda['idEstadoVivienda'] = range(1, len(df_estado_vivienda) + 1)
df_agua['idAgua'] = range(1, len(df_agua) + 1)
df_telefono['idTelefono'] = range(1, len(df_telefono) + 1)
df_celular['idCelular'] = range(1, len(df_celular) + 1)
df_television['idTelevision'] = range(1, len(df_television) + 1)
df_internet['idInternet'] = range(1, len(df_internet) + 1)
df_servicios_higienicos['idServiciosHigienicos'] = range(1, len(df_servicios_higienicos) + 1)
df_educacion_ninos['idEducacionNinos'] = range(1, len(df_educacion_ninos) + 1)
df_departamento['idDepartamento'] = range(1, len(df_departamento) + 1)
df_provincia['idProvincia'] = range(1, len(df_provincia) + 1)
df_distrito['idDistrito'] = range(1, len(df_distrito) + 1)

In [309]:
df_tiempo.head()

    AÑO  MES  idTiempo
0  2013    5         1
1  2013    8         2
2  2013   11         3
3  2013    2         4
4  2013    3         5

In [310]:
df_distrito.head()

      distrito  idDistrito
0  CHACHAPOYAS           1
1      CUISPES           2
2       CONILA           3
3     COLCAMAR           4
4     LA JALCA           5

In [311]:
# Columnas y tipos de datos en el esquema de la fact table
data = {
    "idTiempo": pd.Series(dtype="int"),
    "id_departamento": pd.Series(dtype="int"),
    "id_provincia": pd.Series(dtype="int"),
    "id_distrito": pd.Series(dtype="int"),
    "idSexo": pd.Series(dtype="int"),
    "idEstadoCivil": pd.Series(dtype="int"),
    "idEducacion": pd.Series(dtype="int"),
    "idTrabajo": pd.Series(dtype="int"),
    "idTipoVivienda": pd.Series(dtype="int"),
    "idAgua": pd.Series(dtype="int"),
    "idTelefono": pd.Series(dtype="int"),
    "idCelular": pd.Series(dtype="int"),
    "idTelevision": pd.Series(dtype="int"),
    "idInternet": pd.Series(dtype="int"),
    "idServiciosHigienicos": pd.Series(dtype="int"),
    "idEducacionNiños": pd.Series(dtype="int"),
    "idEstadoVivienda": pd.Series(dtype="int"),
    "gananciaNeta": pd.Series(dtype="float"),
    "gastoEnProductos": pd.Series(dtype="float"),
    "horasTrabajoSemAnterior": pd.Series(dtype="int"),
    "tiempoTrabajoAños": pd.Series(dtype="int"),
    "tiempoTrabajoMeses": pd.Series(dtype="int"),
    "numeroHabitaciones": pd.Series(dtype="int"),
    "altitud": pd.Series(dtype="float"),
    "latitud": pd.Series(dtype="float"),
    "longitud": pd.Series(dtype="float")
}

# Creando el DataFrame vacío basado en el esquema
df_factBalanceEconomico = pd.DataFrame(data)

In [312]:
df_factBalanceEconomico

Empty DataFrame
Columns: [idTiempo, id_departamento, id_provincia, id_distrito, idSexo, idEstadoCivil, idEducacion, idTrabajo, idTipoVivienda, idAgua, idTelefono, idCelular, idTelevision, idInternet, idServiciosHigienicos, idEducacionNiños, idEstadoVivienda, gananciaNeta, gastoEnProductos, horasTrabajoSemAnterior, tiempoTrabajoAños, tiempoTrabajoMeses, numeroHabitaciones, altitud, latitud, longitud]
Index: []

[0 rows x 26 columns]

In [313]:
df_distrito.head()

      distrito  idDistrito
0  CHACHAPOYAS           1
1      CUISPES           2
2       CONILA           3
3     COLCAMAR           4
4     LA JALCA           5

In [314]:
try:
    for index, row in df_distrito.iterrows():
        cursor.execute("INSERT INTO dimDistrito (id_distrito, nombre_distrito) VALUES (?, ?)", row['idDistrito'], row['distrito'])
    conn.commit()  
except pyodbc.Error as e:
    print("Error al insertar registros en dimDistrito:", e)
    conn.rollback()

In [315]:
df_provincia.head(1)

     provincia  idProvincia
0  CHACHAPOYAS            1

In [316]:
try:
    for index, row in df_provincia.iterrows():
        cursor.execute("INSERT INTO dimProvincia (id_provincia, nombre_provincia) VALUES (?, ?)", row['idProvincia'], row['provincia'])
    conn.commit()  
except ValueError:
    print("Error al insertar registros en dimProvincia")

In [317]:
df_departamento.head(1)

  departamento  idDepartamento
0     AMAZONAS               1

In [318]:
try:
    for index, row in df_departamento.iterrows():
        cursor.execute("INSERT INTO dimDepartamento (id_departamento, nombre_departamento) VALUES (?, ?)", row['idDepartamento'], row['departamento'])
    conn.commit()  
except ValueError:
    print("Error al insertar registros en dimDepartamento")

In [319]:
df_sexo.head(1)

    SEXO  idSexo
0  Mujer       1

In [320]:
try:
    for index, row in df_sexo.iterrows():
        cursor.execute("INSERT INTO dimSexo (idSexo, sexo) VALUES (?, ?)", row['idSexo'], row['SEXO'])
    conn.commit() 
except ValueError:
    print("Error al insertar registros en dimSexo")

In [321]:
df_estado_civil.head(1)

  ESTADO_CIVIL  idEstadoCivil
0     Viudo(a)              1

In [322]:
try:
    for index, row in df_estado_civil.iterrows():
        cursor.execute("INSERT INTO dimEstadoCivil (idEstadoCivil, estadoCivil) VALUES (?, ?)", row['idEstadoCivil'], row['ESTADO_CIVIL'])
    conn.commit()  
except ValueError:
    print("Error al insertar registros en dimEstadoCivil")

In [323]:
df_educacion.head(1)

  GRADO_DE_INSTRUCCION  idEducacion
0  Primaria Incompleta            1

In [324]:
try:
    for index, row in df_educacion.iterrows():
        cursor.execute("INSERT INTO dimEducacion (idEducacion, gradoInstruccion) VALUES (?, ?)", row['idEducacion'], row['GRADO_DE_INSTRUCCION'])
    conn.commit()  
except ValueError:
    print("Error al insertar registros en dimEducacion")

In [325]:
df_trabajo.head(1)

        LABOR_QUE_DESEMPEÑA  idTrabajo
0  Trabajador Independiente          1

In [326]:
try:
    for index, row in df_trabajo.iterrows():
        cursor.execute("INSERT INTO dimTrabajo (idTrabajo, laborDesempeñada) VALUES (?, ?)", row['idTrabajo'], row['LABOR_QUE_DESEMPEÑA'])
    conn.commit()  
except ValueError:
    print("Error al insertar registros en dimTrabajo")

In [327]:
df_tipo_vivienda.head(1)

     Tipo de vivienda  idTipoVivienda
0  Casa independiente               1

In [328]:
try:
    for index, row in df_tipo_vivienda.iterrows():
        cursor.execute("INSERT INTO dimTipoVivienda (idTipoVivienda, tipoVivienda) VALUES (?, ?)", row['idTipoVivienda'], row['Tipo de vivienda'])
    conn.commit()  
except ValueError:
    print("Error al insertar registros en dimTipoVivienda")

In [329]:
df_agua.head(1)

                                 Agua  idAgua
0  Red pública, dentro de la vivienda       1

In [330]:
try:
    for index, row in df_agua.iterrows():
        cursor.execute("INSERT INTO dimAgua (idAgua, agua) VALUES (?, ?)", row['idAgua'], row['Agua'])
    conn.commit()  
except ValueError:
    print("Error al insertar registros en dimAgua")

In [331]:
df_telefono.head(1)

  Telefono  idTelefono
0       No           1

In [332]:
try:
    for index, row in df_telefono.iterrows():
        cursor.execute("INSERT INTO dimTelefono (idTelefono, telefono) VALUES (?, ?)", row['idTelefono'], row['Telefono'])
    conn.commit()  
except ValueError:
    print("Error al insertar registros en dimTelefono")

In [333]:
df_celular.head(1)

  Celular  idCelular
0      No          1

In [334]:
try:
    for index, row in df_celular.iterrows():
        cursor.execute("INSERT INTO dimCelular (idCelular, celular) VALUES (?, ?)", row['idCelular'], row['Celular'])
    conn.commit()  
except ValueError:
    print("Error al insertar registros en dimCelular")

In [335]:
df_television.head(1)

  Television  idTelevision
0         Sí             1

In [336]:
try:
    for index, row in df_television.iterrows():
        cursor.execute("INSERT INTO dimTelevision (idTelevision, television) VALUES (?, ?)", row['idTelevision'], row['Television'])
    conn.commit()  
except ValueError:
    print("Error al insertar registros en dimTelevision")

In [337]:
df_internet.head(1)

  Internet  idInternet
0       No           1

In [338]:
try:
    for index, row in df_internet.iterrows():
        cursor.execute("INSERT INTO dimInternet (idInternet, internet) VALUES (?, ?)", row['idInternet'], row['Internet'])
    conn.commit()  
except ValueError:
    print("Error al insertar registros en dimInternet")

In [339]:
df_servicios_higienicos.head(1)

  Servicios higienicos  idServiciosHigienicos
0                   No                      1

In [340]:
try:
    for index, row in df_servicios_higienicos.iterrows():
        cursor.execute("INSERT INTO dimServiciosHigienicos (idServiciosHigienicos, serviciosHigienicos) VALUES (?, ?)", row['idServiciosHigienicos'], row['Servicios higienicos'])
    conn.commit()  
except ValueError:
    print("Error al insertar registros en dimServiciosHigienicos")

In [341]:
df_educacion_ninos.head(1)

                             Niños en colegio  idEducacionNinos
0  Hogares con niños que asisten a la escuela                 1

In [342]:
try:
    for index, row in df_educacion_ninos.iterrows():
        cursor.execute("INSERT INTO dimEducacionNiños (idEducacionNiños, niñosEnColegio) VALUES (?, ?)", row['idEducacionNinos'], row['Niños en colegio'])
    conn.commit()  
except ValueError:
    print("Error al insertar registros en dimEducacionNiños")

In [343]:
df_estado_vivienda.head(1)

                      Estado  idEstadoVivienda
0  Propia, totalmente pagada                 1

In [344]:
try:
    for index, row in df_estado_vivienda.iterrows():
        cursor.execute("INSERT INTO dimEstadoVivienda (idEstadoVivienda, estadoVivienda) VALUES (?, ?)", row['idEstadoVivienda'], row['Estado'])
    conn.commit()  
except ValueError:
    print("Error al insertar registros en dimEstadoVivienda")

In [345]:
df_tiempo.head()

    AÑO  MES  idTiempo
0  2013    5         1
1  2013    8         2
2  2013   11         3
3  2013    2         4
4  2013    3         5

In [346]:
try:
    for index, row in df_tiempo.iterrows():
        cursor.execute("INSERT INTO dimTiempo (idTiempo, año, mes) VALUES (?, ?, ?)", int(row['idTiempo']), int(row['AÑO']), int(row['MES']))
    conn.commit()
except ValueError:
    print("Error al insertar registros en dimEstadoVivienda")

In [347]:
df_factBalanceEconomico.columns

Index(['idTiempo', 'id_departamento', 'id_provincia', 'id_distrito', 'idSexo',
       'idEstadoCivil', 'idEducacion', 'idTrabajo', 'idTipoVivienda', 'idAgua',
       'idTelefono', 'idCelular', 'idTelevision', 'idInternet',
       'idServiciosHigienicos', 'idEducacionNiños', 'idEstadoVivienda',
       'gananciaNeta', 'gastoEnProductos', 'horasTrabajoSemAnterior',
       'tiempoTrabajoAños', 'tiempoTrabajoMeses', 'numeroHabitaciones',
       'altitud', 'latitud', 'longitud'],
      dtype='object')

In [348]:
df.columns

Index(['AÑO', 'MES', 'LABOR_QUE_DESEMPEÑA', 'HORAS_TRABAJO_SEM_ANTERIOR',
       'TIEMPO_TRABAJO_AÑOS', 'TIEMPO_TRABAJO_MESES', 'GANANCIA_NETA',
       'GASTO_EN_PRODUCTOS', 'SEXO', 'ESTADO_CIVIL', 'GRADO_DE_INSTRUCCION',
       'Tipo de vivienda', 'Numero de habitaciones', 'Estado', 'Agua',
       'Telefono', 'Celular', 'Television', 'Internet', 'Servicios higienicos',
       'Niños en colegio', 'departamento', 'provincia', 'distrito', 'altitud',
       'latitud', 'longitud'],
      dtype='object')

In [349]:
df_tiempo.head(1)

    AÑO  MES  idTiempo
0  2013    5         1

In [350]:
df_tiempo['AÑO-MES'] = df_tiempo['AÑO'].astype('str')+'-'+df_tiempo['MES'].astype('str')
df_tiempo.head(1)

    AÑO  MES  idTiempo AÑO-MES
0  2013    5         1  2013-5

In [351]:
df['AÑO-MES'] = df['AÑO'].astype('str')+'-'+df['MES'].astype('str')
df.head(1)

,AÑO,MES,LABOR_QUE_DESEMPEÑA,HORAS_TRABAJO_SEM_ANTERIOR,TIEMPO_TRABAJO_AÑOS,TIEMPO_TRABAJO_MESES,GANANCIA_NETA,GASTO_EN_PRODUCTOS,SEXO,ESTADO_CIVIL,...,Internet,Servicios higienicos,Niños en colegio,departamento,provincia,distrito,altitud,latitud,longitud,AÑO-MES
0,2013,5,Trabajador Independiente,49,1,0,27.0,152.0,Mujer,Viudo(a),...,No,No,Hogares con niños que asisten a la escuela,AMAZONAS,CHACHAPOYAS,CHACHAPOYAS,2338.0,-6.2294,-77.8728,2013-5

In [352]:
df_merged1 = df.merge(df_distrito[['distrito', 'idDistrito']], left_on='distrito', right_on='distrito', how='left')
df_merged2 = df_merged1.merge(df_provincia[['provincia','idProvincia']],left_on='provincia',right_on='provincia',how='left')
df_merged3 = df_merged2.merge(df_departamento[['departamento','idDepartamento']],left_on='departamento',right_on='departamento',how='left')
df_merged4 = df_merged3.merge(df_sexo[['SEXO','idSexo']],left_on='SEXO',right_on='SEXO',how='left')
df_merged5 = df_merged4.merge(df_estado_civil[['ESTADO_CIVIL','idEstadoCivil']],left_on='ESTADO_CIVIL',right_on='ESTADO_CIVIL',how='left')
df_merged6 = df_merged5.merge(df_educacion[['GRADO_DE_INSTRUCCION','idEducacion']],left_on='GRADO_DE_INSTRUCCION',right_on='GRADO_DE_INSTRUCCION',how='left')
df_merged7 = df_merged6.merge(df_trabajo[['LABOR_QUE_DESEMPEÑA','idTrabajo']],left_on='LABOR_QUE_DESEMPEÑA',right_on='LABOR_QUE_DESEMPEÑA',how='left')
df_merged8 = df_merged7.merge(df_tipo_vivienda[['Tipo de vivienda','idTipoVivienda']],left_on='Tipo de vivienda',right_on='Tipo de vivienda',how='left')
df_merged9 = df_merged8.merge(df_agua[['Agua','idAgua']],left_on='Agua',right_on='Agua',how='left')
df_merged10 = df_merged9.merge(df_telefono[['Telefono','idTelefono']],left_on='Telefono',right_on='Telefono',how='left')
df_merged11 = df_merged10.merge(df_celular[['Celular','idCelular']],left_on='Celular',right_on='Celular',how='left')
df_merged12 = df_merged11.merge(df_television[['Television','idTelevision']],left_on='Television',right_on='Television',how='left')
df_merged13 = df_merged12.merge(df_internet[['Internet','idInternet']],left_on='Internet',right_on='Internet',how='left')
df_merged14 = df_merged13.merge(df_servicios_higienicos[['Servicios higienicos','idServiciosHigienicos']],left_on='Servicios higienicos',right_on='Servicios higienicos',how='left')
df_merged15 = df_merged14.merge(df_educacion_ninos[['Niños en colegio','idEducacionNinos']],left_on='Niños en colegio',right_on='Niños en colegio',how='left')
df_merged16 = df_merged15.merge(df_estado_vivienda[['Estado','idEstadoVivienda']],left_on='Estado',right_on='Estado',how='left')
df_merged17 = df_merged16.merge(df_tiempo[['AÑO','MES','idTiempo','AÑO-MES']],left_on='AÑO-MES',right_on='AÑO-MES',how='left')

In [353]:
df_merged17.columns

Index(['AÑO_x', 'MES_x', 'LABOR_QUE_DESEMPEÑA', 'HORAS_TRABAJO_SEM_ANTERIOR',
       'TIEMPO_TRABAJO_AÑOS', 'TIEMPO_TRABAJO_MESES', 'GANANCIA_NETA',
       'GASTO_EN_PRODUCTOS', 'SEXO', 'ESTADO_CIVIL', 'GRADO_DE_INSTRUCCION',
       'Tipo de vivienda', 'Numero de habitaciones', 'Estado', 'Agua',
       'Telefono', 'Celular', 'Television', 'Internet', 'Servicios higienicos',
       'Niños en colegio', 'departamento', 'provincia', 'distrito', 'altitud',
       'latitud', 'longitud', 'AÑO-MES', 'idDistrito', 'idProvincia',
       'idDepartamento', 'idSexo', 'idEstadoCivil', 'idEducacion', 'idTrabajo',
       'idTipoVivienda', 'idAgua', 'idTelefono', 'idCelular', 'idTelevision',
       'idInternet', 'idServiciosHigienicos', 'idEducacionNinos',
       'idEstadoVivienda', 'AÑO_y', 'MES_y', 'idTiempo'],
      dtype='object')

In [354]:
df_tiempo.head()

    AÑO  MES  idTiempo  AÑO-MES
0  2013    5         1   2013-5
1  2013    8         2   2013-8
2  2013   11         3  2013-11
3  2013    2         4   2013-2
4  2013    3         5   2013-3

In [355]:
df_tiempo.shape

(132, 4)

In [356]:
df_tiempo['idTiempo'].unique()

array([  1,   2,   3,   4,   5,   6,   7,   8,   9,  10,  11,  12,  13,
        14,  15,  16,  17,  18,  19,  20,  21,  22,  23,  24,  25,  26,
        27,  28,  29,  30,  31,  32,  33,  34,  35,  36,  37,  38,  39,
        40,  41,  42,  43,  44,  45,  46,  47,  48,  49,  50,  51,  52,
        53,  54,  55,  56,  57,  58,  59,  60,  61,  62,  63,  64,  65,
        66,  67,  68,  69,  70,  71,  72,  73,  74,  75,  76,  77,  78,
        79,  80,  81,  82,  83,  84,  85,  86,  87,  88,  89,  90,  91,
        92,  93,  94,  95,  96,  97,  98,  99, 100, 101, 102, 103, 104,
       105, 106, 107, 108, 109, 110, 111, 112, 113, 114, 115, 116, 117,
       118, 119, 120, 121, 122, 123, 124, 125, 126, 127, 128, 129, 130,
       131, 132])

In [357]:
try:
    for index, row in df_merged17.iterrows():
        cursor.execute("INSERT INTO factBalanceEconomico (idTiempo,id_departamento,id_provincia,id_distrito,idSexo,idEstadoCivil,idEducacion,idTrabajo,idTipoVivienda,idAgua,idTelefono,idCelular,idTelevision,idInternet,idServiciosHigienicos,idEducacionNiños,idEstadoVivienda,gananciaNeta,gastoEnProductos,horasTrabajoSemAnterior,tiempoTrabajoAños,tiempoTrabajoMeses,numeroHabitaciones,altitud,latitud,longitud) VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)", 
                       row['idTiempo'], row['idDepartamento'], row['idProvincia'],row['idDistrito'],row['idSexo'],row['idEstadoCivil'],
                       row['idEducacion'],row['idTrabajo'],row['idTipoVivienda'],row['idAgua'],row['idTelefono'],row['idCelular'],row['idTelevision'],
                       row['idInternet'],row['idServiciosHigienicos'],row['idEducacionNinos'],row['idEstadoVivienda'],row['GANANCIA_NETA'],
                       row['GASTO_EN_PRODUCTOS'],row['HORAS_TRABAJO_SEM_ANTERIOR'],row['TIEMPO_TRABAJO_AÑOS'],row['TIEMPO_TRABAJO_MESES'],
                       row['Numero de habitaciones'],row['altitud'],row['latitud'],row['longitud'])
    conn.commit()
except ValueError:
    print("Error al insertar registros en dimEstadoVivienda")